Revit 2024 API
DXFExportOptions Class
 The export options used by exporting DXF format file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class DXFExportOptions : ACADExportOptions
Visual Basic
Public Class DXFExportOptions _
	Inherits ACADExportOptions
Visual C++
public ref class DXFExportOptions : public ACADExportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseExportOptions
 Autodesk.Revit.DB.ACADExportOptions
 Autodesk.Revit.DB.DXFExportOptions
See Also
DXFExportOptions Members
Autodesk.Revit.DB Namespace